simd/P3024_interface_directions_for_simd.org
#+AUTHOR: Jeff Garland, David Sankel, Matthias Kretz, Ruslan Arutyunyan
#+TITLE: P3024R0 Interface Directions for ~std::simd~
#+EMAIL: jeff@crystalclearsoftware.com
#+REVISION: 0
#+STARTUP: inlineimages
#+OPTIONS: num:nil toc:nil reveal_slide_number:"c/t" 
#+REVEAL_HLEVEL: 1
#+REVEAL_THEME: white_contrast_compact_verbatim_headers
#+REVEAL_TRANS: fade
* Goals & Context
- Improve the experience of all users of ~std::simd~  
- Increase the ~std::simd~ coherence with standard c++
- Continue to support best performance possible  
- Outline path forward for c++26 ~simd~ interface
- Increase committee consensus on final direction forward
- Context
  - agree on almost everything
  - where we disagree we, agree on the characterization of the tradeoffs
* Outline
- Construction
  - range constructors
  - safety
- Vectorizable type support: enum and ~std::byte~
- operator[] and proxy references
- ~simd~ as a range
- input-output support
- algorithm naming
- regular redux  
* Construction of ~std::simd~
** Current api
#+begin_src c++
  constexpr simd() noexcept;  //does not initialize

  template<class U> 
  constexpr simd(U&& value) noexcept;  //broadcast

  template<class U, class UAbi>
  constexpr explicit simd(const simd<U, UAbi>&) noexcept;

  template<class G> constexpr explicit simd(G&& gen) noexcept;

  template<contiguous_iterator It, class Flags = element_aligned_tag>
  constexpr simd(const It& first, Flags = {})

  template<class U, class Flags = element_aligned_tag> 
  void copy_from(const U* mem, Flags = {}) &&

  template<class U, class Flags = element_aligned_tag>
  void copy_to(U* mem, Flags = {}) const &&;
#+end_src
** Current usage
#+begin_src c++
#include <experimental/simd>
namespace stdx = std::experimental;
using intv8  = stdx::fixed_size_simd<int,8>;

intv8 add_v(const intv8& a, const intv8& b)
{
    return a + b;
}
int main()
{
    int a_data[] = {1, 2, 3, 4, 5, 6, 7, 8};
    intv8 a;
    a.copy_from(&a_data[0], stdx::element_aligned);
    int b_data[] = {7, 6, 5, 4, 3, 2, 1, 0};
    intv8 b;
    b.copy_from(&b_data[0], stdx::element_aligned);
    intv8 c = add_v( a, b );
 
    for (int i=0; i< c.size(); i++)
    {
       int val = c[i];
       print("{} ", val);
    }  
}
#+end_src
https://godbolt.org/z/sPdzGWEnx
** Concerns and omissions
- ~copy_from~ and ~continguous_iterator~ api are tricky to use
  - on user to ensure does not run off the end
  - occurs when: size mismatch between simd and data type
  - with ~native_abi~ version size determined by compiler
  - done for efficiency
- default construction does not initialize
  - UB to use it in that state
** Usage Desires - contiguous static extent types
- ~array~, c array, ~span~, ~initializer_list~
  - ~initializer_list~ interacts poorly with broadcast constructor
- size mismatch
  - too small --> default initialize remaining elements
  - too large --> not compile
#+begin_src c++
  namespace stdx = std::experimental;
  using simd_int_8  = stdx::fixed_size_simd<int,8>;

  std::array<int, 8> data = {0, 1, 2, 3, 4, 5, 6, 7};
  simd_int_8 simd1{data};

  std::span<int, 8> sdata{data};
  simd_int_8 simd2{sdata};

  int cdata[] = {0, 1, 2, 3, 4, 5, 6, 7};
  simd_int_8 simd3{cdata};

  simd_int_8 simd4 = {0, 1, 2, 3, 4, 5, 6, 7}; // initializer list*
#+end_src
** Usage Desires - contiguous dynamic extent types
#+BEGIN_NOTES
C++ programmers will expect ~std::simd~ to easily construct from other standard library types
#+END_NOTES
- ~vector<data-parallel-type>~
- ~string~ and ~string_view~
- ~span<data-parallel-type>~
#+begin_src c++
  namespace stdx = std::experimental;
  using simd_int_8  = stdx::fixed_size_simd<int,8>;

  std::vector<int> vdata = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
  simd_int_8 simd1{data}; //drops 8, 9

  std::span<int> data{vdata};
  simd_int_8 simd2{sdata}; //drops 8, 9

  std::string s{"hello");
  simd_int_8 simd3{s}; //default initialize remaining
#+end_src

