simd/P3024_interface_directions_for_simd.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>P3024R0 Additional interfaces for <code>std::simd</code></title>
<meta name="author" content="Jeff Garland, David Sankel, Matthias Kretz, Ruslan Arutyunyan"/>
<link rel="stylesheet" href="file:///Users/jeff/Documents/devtools/reveal.js-4.6.0/dist/reveal.css"/>

<link rel="stylesheet" href="file:///Users/jeff/Documents/devtools/reveal.js-4.6.0/dist/theme/white_contrast_compact_verbatim_headers.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">P3024R0 Additional interfaces for <code>std::simd</code></h1><h2 class="author">Jeff Garland, David Sankel, Matthias Kretz, Ruslan Arutyunyan</h2><p class="date">Created: 2023-11-07 Tue 22:45</p>
</section>



<section>
<section id="slide-org38b2be3">
<h2 id="org38b2be3">Goals &amp; Context</h2>
<ul>
<li>Improve the experience of all users of <code>std::simd</code></li>
<li>Increase the <code>std::simd</code> coherence with standard c++</li>
<li>Continue to support best performance possible</li>
<li>Outline path forward for c++26 <code>simd</code> interface</li>
<li>Increase committee consensus on final direction forward</li>
<li>Context
<ul>
<li>agree on almost everything</li>
<li>where we disagree we, agree on the characterization of the tradeoffs</li>

</ul></li>

</ul>

</section>
</section>
<section>
<section id="slide-orgbf82c39">
<h2 id="orgbf82c39">Outline</h2>
<ul>
<li>Construction
<ul>
<li>range constructors</li>
<li>safety</li>

</ul></li>
<li>Vectorizable type support: enum and <code>std::byte</code></li>
<li>operator[] and proxy references</li>
<li><code>simd</code> as a range</li>
<li>input-output support</li>
<li>regular redux</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc0f2095">
<h2 id="orgc0f2095">Construction of <code>std::simd</code></h2>
<div class="outline-text-2" id="text-orgc0f2095">
</div>
</section>
<section id="slide-orgcd7d77b">
<h3 id="orgcd7d77b">Current api</h3>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">simd</span>() <span style="color: #a020f0;">noexcept</span>;  <span style="color: #b22222;">//</span><span style="color: #b22222;">does not initialize</span>

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">U</span>&gt; 
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">simd</span>(<span style="color: #228b22;">U</span>&amp;&amp; <span style="color: #a0522d;">value</span>) <span style="color: #a020f0;">noexcept</span>;  <span style="color: #b22222;">//</span><span style="color: #b22222;">broadcast</span>

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">U</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UAbi</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #a020f0;">explicit</span> <span style="color: #0000ff;">simd</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">U</span>, <span style="color: #228b22;">UAbi</span>&gt;&amp;) <span style="color: #a020f0;">noexcept</span>;

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">G</span>&gt; <span style="color: #a020f0;">constexpr</span> <span style="color: #a020f0;">explicit</span> <span style="color: #0000ff;">simd</span>(<span style="color: #228b22;">G</span>&amp;&amp; <span style="color: #a0522d;">gen</span>) <span style="color: #a020f0;">noexcept</span>;

<span style="color: #a020f0;">template</span>&lt;<span style="color: #228b22;">contiguous_iterator</span> <span style="color: #228b22;">It</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">simd</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">It</span>&amp; <span style="color: #a0522d;">first</span>, Flags = {})

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">U</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt; 
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">copy_from</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">U</span>* <span style="color: #a0522d;">mem</span>, Flags = {}) &amp;&amp;

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">U</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #228b22;">void</span> copy_to(<span style="color: #228b22;">U</span>* <span style="color: #a0522d;">mem</span>, Flags = {}) <span style="color: #a020f0;">const</span> &amp;&amp;;
</pre>
</div>
</section>
<section id="slide-org0f7f629">
<h3 id="org0f7f629">Current usage</h3>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;experimental/simd&gt;</span>
<span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">stdx</span> = <span style="color: #008b8b;">std</span>::experimental;
<span style="color: #a020f0;">using</span> <span style="color: #228b22;">intv8</span>  = <span style="color: #008b8b;">stdx</span>::<span style="color: #228b22;">fixed_size_simd</span>&lt;<span style="color: #228b22;">int</span>,8&gt;;

<span style="color: #228b22;">intv8</span> <span style="color: #0000ff;">add_v</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">intv8</span>&amp; <span style="color: #a0522d;">a</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">intv8</span>&amp; <span style="color: #a0522d;">b</span>)
{
    <span style="color: #a020f0;">return</span> a + b;
}
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a_data</span>[] = {1, 2, 3, 4, 5, 6, 7, 8};
    <span style="color: #228b22;">intv8</span> <span style="color: #a0522d;">a</span>;
    a.copy_from(&amp;a_data[0], <span style="color: #008b8b;">stdx</span>::element_aligned);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b_data</span>[] = {7, 6, 5, 4, 3, 2, 1, 0};
    <span style="color: #228b22;">intv8</span> <span style="color: #a0522d;">b</span>;
    b.copy_from(&amp;b_data[0], <span style="color: #008b8b;">stdx</span>::element_aligned);
    <span style="color: #228b22;">intv8</span> <span style="color: #a0522d;">c</span> = add_v( a, b );

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt; c.size(); i++)
    {
       <span style="color: #228b22;">int</span> <span style="color: #a0522d;">val</span> = c[i];
       print(<span style="color: #8b2252;">"{} "</span>, val);
    }  
}
</pre>
</div>
<p>
<a href="https://godbolt.org/z/sPdzGWEnx">https://godbolt.org/z/sPdzGWEnx</a>
</p>
</section>
<section id="slide-orgecf64bd">
<h3 id="orgecf64bd">Concerns and omissions</h3>
<ul>
<li><code>copy_from</code> and <code>continguous_iterator</code> api are tricky to use
<ul>
<li>on user to ensure does not run off the end</li>
<li>occurs when: size mismatch between simd and data type</li>
<li>with <code>native_abi</code> version size determined by compiler</li>
<li>done for efficiency</li>

</ul></li>
<li>default construction does not initialize
<ul>
<li>UB to use it in that state</li>

</ul></li>

</ul>
</section>
<section id="slide-org520f5e2">
<h3 id="org520f5e2">Usage Desires - contiguous static extent types</h3>
<ul>
<li><code>array</code>, c array, <code>span</code>, <code>initializer_list</code></li>
<li>* <code>initializer_list</code> interacts poorly with broadcast constructor</li>
<li>size mismatch
<ul>
<li>too small &#x2013;&gt; zero remaining elements</li>
<li>too large &#x2013;&gt; not compile</li>

</ul></li>

</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">stdx</span> = <span style="color: #008b8b;">std</span>::experimental;
<span style="color: #a020f0;">using</span> <span style="color: #228b22;">simd_int_8</span>  = <span style="color: #008b8b;">stdx</span>::<span style="color: #228b22;">fixed_size_simd</span>&lt;<span style="color: #228b22;">int</span>,8&gt;;

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">array</span>&lt;<span style="color: #228b22;">int</span>, 8&gt; <span style="color: #a0522d;">data</span> = {0, 1, 2, 3, 4, 5, 6, 7};
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd1</span>{data};

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">span</span>&lt;<span style="color: #228b22;">int</span>, 8&gt; <span style="color: #a0522d;">sdata</span>{data};
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd2</span>{sdata};

<span style="color: #228b22;">int</span> <span style="color: #a0522d;">cdata</span>[] = {0, 1, 2, 3, 4, 5, 6, 7};
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd3</span>{cdata};

<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd4</span> = {0, 1, 2, 3, 4, 5, 6, 7}; <span style="color: #b22222;">// </span><span style="color: #b22222;">initializer list*</span>
</pre>
</div>
</section>
<section id="slide-orgd7699c9">
<h3 id="orgd7699c9">Usage Desires - contiguous dynamic extent types</h3>
<aside class="notes">
<p>
C++ programmers will expect <code>std::simd</code> to easily construct from other standard library types
</p>

</aside>
<ul>
<li><code>vector&lt;data-parallel-type&gt;</code></li>
<li><code>string</code> and <code>string_view</code></li>
<li><code>span&lt;data-parallel-type&gt;</code></li>

</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">stdx</span> = <span style="color: #008b8b;">std</span>::experimental;
<span style="color: #a020f0;">using</span> <span style="color: #228b22;">simd_int_8</span>  = <span style="color: #008b8b;">stdx</span>::<span style="color: #228b22;">fixed_size_simd</span>&lt;<span style="color: #228b22;">int</span>,8&gt;;

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">vdata</span> = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd1</span>{data}; <span style="color: #b22222;">//</span><span style="color: #b22222;">drops 8, 9</span>

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">span</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">data</span>{vdata};
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd2</span>{sdata}; <span style="color: #b22222;">//</span><span style="color: #b22222;">drops 8, 9</span>

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> <span style="color: #a0522d;">s</span>{<span style="color: #8b2252;">"hello"</span>);
<span style="color: #228b22;">simd_int_8</span> <span style="color: #a0522d;">simd3</span>{s}; <span style="color: #b22222;">//</span><span style="color: #b22222;">'zero out' remaining</span>

</pre>
</div>

</section>
