simd/P3024_interface_directions_for_simd.org
** Contiguous Range Constructor Proposal
- recommendation:
  - add safe range constructors
  - keep opt in unsafe for performance (unless safe has no loss)
  - investigate other range constructors (input_range) 
- range constructor correctly handles mismatched size
  - cost will be measured
- max performance still allowed using unsafe opt in    
- similar changes for ~copy_from~
#+begin_src c++
  template<contiguous_range R, class Flags = element_aligned_tag>
  constexpr simd(R&& r, Flags = {})

  template<contiguous_range R, class Flags = element_aligned_tag>
  constexpr copy_from(R&& r, Flags = {})
    
  template<contiguous_iterator It, class Flags = element_aligned_tag>
  constexpr simd( simdunchecked_t{}, const It& first, Flags = {})

  template<contiguous_iterator It, class Flags = element_aligned_tag>
  constexpr unsafe_copy_from ( const It& first, Flags = {})
#+end_src
** Default constructor and UB
- unfortunately ~vector<simd>~ is something we need
- performance is impacted
- not sure of a great approach
#+begin_src c++
  std::simd<int> simd, simd2;
  auto simd_result = simd + simd2;

  //opt in to unitialized?
  std::simd<int> simd { simdunchecked_t{} };
#+end_src
#+BEGIN_NOTES
In this toy example it's obvious, but in other contexts where simd is passed as a parameter it would be easy to pass an unitialized simd as a parameter.  Since there's not way to interogate the simd state this is less than ideal.
#+END_NOTES

** initializer list
- [[http://wg21.link/P2876][P2876R0 Proposal to extend std::simd with more constructors and accessors]].
- Recommendation:
  - leave ~initializer_list~ out in core
  - add it as P2876 progresses
  - consider using a broadcast wrapper to handle ambiguity
#+begin_src c++
  simd<int> a(1);       // [1, 1, 1, 1]
  simd<int> b{1};       // [1, 1, 1, 1]
  simd<int> c = {1};    // [1, 1, 1, 1]
  simd<int> d{1, 0};    // [1, 0, 0, 0]
  simd<int> e = {1, 0}; // [1, 0, 0, 0]
// alternate
  simd<int> a(1);         // [1, 0, 0, 0]
  simd<int> b{1};         // [1, 0, 0, 0]
  simd<int> c = {1};      // [1, 0, 0 ,0]
  simd<int> d{1, 2};      // [1, 2, 0, 0]
  simd<int> e = {1, 2};   // [1, 2, 0, 0]
  simd<int> f(bcast(1));  // [1, 1, 1, 1]
  simd<int> b = bcast(1); // [1, 1, 1, 1]
#+end_src
* Vectorizable type Type support enum and ~std::byte~
- ~std::byte~ is a safer ~unsigned char~ for bitops
- makes sense to make simd from ~span<byte>~
- generalized enum support is more complex
- recommendation: defer general enum support to later    
#+BEGIN_NOTES
What about ~std::simd<std::byte>~? ~std::byte~ is a replacement for ~unsigned char~ that adds type safety and bit manipulation operations. One can certainly imagine writing simd algorithms for byte. 
#+END_NOTES

* ~Operator[]~ and proxy reference
- simd is not a container
  - having ~operator[]~ confusing  
  - proxy can create issues (see also, ~vector<bool>~)
- recommendation:
  - rename to ~get~ and ~set~
  - leave ~operator[]~ when we can make it work well everywhere
- https://godbolt.org/z/cfodY4G1E
#+BEGIN_SRC C++
constexpr reference operator[](simd-size-type) &;
constexpr value_type operator[](simd-size-type) const&

#+END_SRC
* simd as range
- discussed in several papers
- need ~begin~ ~end~ ~iterators~
- get format for free
- problems
  - is it writable?
  - proxies and iterators tricky
- recommendation:
  - table simd as a range for now
  - focus on shipping needed core
* Input-output support
- at a mimimum we'd like output support in format
- pretty much expect output like vector
- iostreams?
  - no lets not
- recommendation:
  - add formatter for ~simd~ and ~simd_mask~
* Algo naming
- naming differences between std algo and simd
- should try to have as much symmetry as possible
- examples
  - ~reduce_count~ -> ~count_if_true~
  - ~reduce_min_index~ -> ~find_if_true~
* Regular redux
- after further discussion there are 2 possible paths
- first: current paper approach
- regular with ~operator==~ and ~operator!=~
  - remove all the ~operator<~, ~operator>~ etc
  - replace them with named functions
  - ~xsimd~ does this and calls them ~eq~, ~neq~, ~gt~, etc
** Pros for current approach
- minimal change with existing scalar alg to work with simd
- minimize cognitive overhead when learning simd
- discoverability
  - if you say ~if (simd == simd )~ compile fail
