simd/P3024_interface_directions_for_simd.html
<section id="slide-org8c56d8e">
<h3 id="org8c56d8e">Contiguous Range Constructor Proposal</h3>
<ul>
<li>recommendation:
<ul>
<li>add safe range constructors</li>
<li>keep opt in unsafe for performance</li>
<li>investigate other range constructors (input<sub>range</sub>)</li>

</ul></li>
<li>range constructor correctly handles mismatched size
<ul>
<li>cost will be measured</li>

</ul></li>
<li>max performance still allowed using unsafe opt in</li>
<li>similar changes for <code>copy_from</code></li>

</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt;<span style="color: #228b22;">contiguous_range</span> <span style="color: #a0522d;">R</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">simd</span>(<span style="color: #228b22;">R</span>&amp;&amp; <span style="color: #a0522d;">r</span>, Flags = {})

<span style="color: #a020f0;">template</span>&lt;<span style="color: #228b22;">contiguous_range</span> <span style="color: #228b22;">R</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">copy_from</span>(<span style="color: #228b22;">R</span>&amp;&amp; <span style="color: #a0522d;">r</span>, Flags = {})

<span style="color: #a020f0;">template</span>&lt;<span style="color: #228b22;">contiguous_iterator</span> <span style="color: #a0522d;">It</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">simd</span>( simdunsafe{}, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">It</span>&amp; <span style="color: #a0522d;">first</span>, Flags = {})

<span style="color: #a020f0;">template</span>&lt;<span style="color: #228b22;">contiguous_iterator</span> <span style="color: #228b22;">It</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Flags</span> = <span style="color: #228b22;">element_aligned_tag</span>&gt;
<span style="color: #a020f0;">constexpr</span> <span style="color: #0000ff;">unsafe_copy_from</span> ( <span style="color: #a020f0;">const</span> <span style="color: #228b22;">It</span>&amp; <span style="color: #a0522d;">first</span>, Flags = {})
</pre>
</div>
</section>
<section id="slide-org7420064">
<h3 id="org7420064">Default constructor and UB</h3>
<ul>
<li>unfortunately <code>vector&lt;simd&gt;</code> is something we need</li>
<li>performance is impacted</li>
<li>not sure of a great approach</li>

</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #008b8b;">std</span>::<span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">simd</span>, <span style="color: #a0522d;">simd2</span>;
<span style="color: #a020f0;">auto</span> <span style="color: #a0522d;">simd_result</span> = simd + simd2;

<span style="color: #b22222;">//</span><span style="color: #b22222;">opt in to unitialized?</span>
<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">simd</span> { simdunsafe{} };
</pre>
</div>
<aside class="notes">
<p>
In this toy example it's obvious, but in other contexts where simd is passed as a parameter it would be easy to pass an unitialized simd as a parameter.  Since there's not way to interogate the simd state this is less than ideal.
</p>

</aside>

</section>
<section id="slide-orge412878">
<h3 id="orge412878">initializer list</h3>
<ul>
<li><a href="http://wg21.link/P2876">P2876R0 Proposal to extend std::simd with more constructors and accessors</a>.</li>
<li>Recommendation:
<ul>
<li>leave <code>initializer_list</code> out in core</li>
<li>add it as P2876 progresses</li>
<li>consider using a broadcast wrapper to handle ambiguity</li>

</ul></li>

</ul>
<div class="org-src-container">

<pre class="src src-c++">  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">a</span>(1);       <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 1, 1, 1]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">b</span>{1};       <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 1, 1, 1]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">c</span> = {1};    <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 1, 1, 1]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">d</span>{1, 0};    <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 0, 0, 0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">e</span> = {1, 0}; <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 0, 0, 0]</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">alternate</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">a</span>(1);         <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 0, 0, 0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">b</span>{1};         <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 0, 0, 0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">c</span> = {1};      <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 0, 0 ,0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">d</span>{1, 2};      <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 2, 0, 0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">e</span> = {1, 2};   <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 2, 0, 0]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #0000ff;">f</span>(bcast(1));  <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 1, 1, 1]</span>
  <span style="color: #228b22;">simd</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">b</span> = bcast(1); <span style="color: #b22222;">// </span><span style="color: #b22222;">[1, 1, 1, 1]</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgea49807">
<h2 id="orgea49807">Vectorizable type Type support enum and <code>std::byte</code></h2>
<ul>
<li><code>std::byte</code> is a safer <code>unsigned char</code> for bitops</li>
<li>makes sense to make simd from <code>span&lt;byte&gt;</code></li>
<li>generalized enum support is more complex</li>
<li>recommendation: defer general enum support to later</li>

</ul>
<aside class="notes">
<p>
What about <code>std::simd&lt;std::byte&gt;</code>? <code>std::byte</code> is a replacement for <code>unsigned char</code> that adds type safety and bit manipulation operations. One can certainly imagine writing simd algorithms for byte. 
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org5f1b9ab">
<h2 id="org5f1b9ab"><code>Operator[]</code> and proxy reference</h2>
<ul>
<li>simd is not a container
<ul>
<li>having <code>operator[]</code> confusing</li>
<li>proxy can create issues (see also, <code>vector&lt;bool&gt;</code>)</li>

</ul></li>
<li>recommendation:
<ul>
<li>rename to <code>get</code> and <code>set</code></li>
<li>leave <code>operator[]</code> when we can make it work well everywhere</li>

</ul></li>
<li><a href="https://godbolt.org/z/cfodY4G1E">https://godbolt.org/z/cfodY4G1E</a></li>

</ul>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #a020f0;">constexpr</span> <span style="color: #228b22;">reference</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(simd-size-type) &amp;;
<span style="color: #a020f0;">constexpr</span> <span style="color: #228b22;">value_type</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(simd-size-type) <span style="color: #a020f0;">const</span>&amp;

</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf8c41ba">
<h2 id="orgf8c41ba">simd as range</h2>
<ul>
<li>discussed in several papers</li>
<li>need <code>begin</code> <code>end</code> <code>iterators</code></li>
<li>get format for free</li>
<li>problems
<ul>
<li>is it writable?</li>
<li>proxies and iterators tricky</li>

</ul></li>
<li>recommendation:
<ul>
<li>table simd as a range for now</li>
<li>focus on shipping needed core</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org84e3efe">
<h2 id="org84e3efe">Input-output support</h2>
<ul>
<li>at a mimimum we'd like output support in format</li>
<li>pretty much expect output like vector</li>
<li>iostreams?
<ul>
<li>no lets not</li>

</ul></li>
<li>recommendation:
<ul>
<li>add formatter for <code>simd</code> and <code>simd_mask</code></li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc69ff2a">
<h2 id="orgc69ff2a">Regular redux</h2>
<ul>
<li>after further discussion there are 2 possible paths</li>
<li>first: current paper approach</li>
<li>regular with <code>operator==</code> and <code>operator!=</code>
<ul>
<li>remove all the <code>operator&lt;</code>, <code>operator&gt;</code> etc</li>
<li>replace them with named functions</li>
<li><code>xsimd</code> does this and calls them <code>eq</code>, <code>neq</code>, <code>gt</code>, etc</li>

</ul></li>

</ul>
</section>
<section id="slide-orgf11c188">
<h3 id="orgf11c188">Pros for current approach</h3>
<ul>
<li>minimal change with existing scalar alg to work with simd</li>
<li>minimize cognitive overhead when learning simd</li>
<li>discoverability
<ul>
<li>if you say <code>if (simd == simd )</code> compile fail</li>

</ul></li>

</ul>
</section>
